projects/toroidal-rov-thruster/prototype2A_M2_openFOAM/0.orig/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

// Specific turbulence dissipation rate, 1/s.

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    farfield
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }

    rotor
    {
        type            omegaWallFunction;
        value           uniform 1;
    }

    stator
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
}
